<html>
<head>
<title>แบทดสอบ</title>
</head>

<h1>วิชาการใช้เทคโนโลยีดิจิทัลเพื่อการศึกษา</h1>
<?php
//คะแนนเริ่มต้น
$score=0;
//แสดงชื่อเมลผู้ทำข้อสอบ
echo "คุณ".$_POST["name"]."<br>";
echo "Email".$_POST["email"]."<br>";

echo "1.ในการใช้งานแอปพลิเคชันที่ใช้ในการสอนและเรียน อะไรเป็นข้อดีของการใช้แอปพลิเคชันที่มีการปรับปรุงและอัปเดตอยู่เสมอ?<br>";
echo $_POST["book1"]."<br>";
//ตรวจคำตอบ
if($_POST["book1"]=="การทำให้นักเรียนมีโอกาสเรียนรู้ได้ตลอดเวลา")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "2.เทคโนโลยีใดมีประโยชน์ในการสร้างสถานการณ์การเรียนรู้ที่มีความเรียนรู้แบบประสบการณ์?";
echo $_POST["book2"]."<br>";
//ตรวจคำตอบ
if($_POST["book2"]=="Virtual Reality")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "3.การใช้เทคโนโลยีดิจิทัลในการสร้างบทเรียนแบบโต้ตอบ (Interactive Lessons) ส่งผลต่อการเรียนรู้ของนักเรียนอย่างไร?<br>";
echo $_POST["book3"]."<br>";
//ตรวจคำตอบ
if($_POST["book3"]=="เพิ่มความน่าสนใจในการเรียน")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "4.การใช้เทคโนโลยีในการสร้างวิดีโอสอนออนไลน์มีประโยชน์อย่างไร?<br>";
echo $_POST["book4"]."<br>";
//ตรวจคำตอบ
if($_POST["book4"]=="ช่วยให้นักเรียนเข้าใจเนื้อหาได้ง่ายขึ้น")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "5.การใช้เทคโนโลยีในการสร้างแบบทดสอบออนไลน์มีประโยชน์ในด้านใด?<br>";
echo $_POST["book5"]."<br>";
//ตรวจคำตอบ
if($_POST["book5"]=="ลดความซับซ้อนในการตรวจสอบและประเมินผล")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "6.ในการใช้เทคโนโลยีดิจิทัลในการสนับสนุนกระบวนการสอนและการเรียน สถานการณ์ใดที่ต้องการความสนับสนุนและความปลอดภัยสูงสุด?<br>";
echo $_POST["book6"]."<br>";
//ตรวจคำตอบ
if($_POST["book6"]=="การแชร์ข้อมูลส่วนตัวระหว่างนักเรียนและอาจารย์")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "7.การใช้เทคโนโลยีในการสร้างสถานการณ์การเรียนรู้ที่มีความเรียนรู้แบบประสบการณ์มีผลเชิงบวกต่อการเรียนรู้อย่างไร?<br>";
echo $_POST["book7"]."<br>";
//ตรวจคำตอบ
if($_POST["book7"]=="เพิ่มความน่าสนใจในการเรียน")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "8.การใช้เทคโนโลยีในการสร้างสถานการณ์การเรียนรู้ที่สมจริง (Virtual Reality) สามารถช่วยในการเรียนรู้เรื่องใดได้ดีที่สุด?<br>";
echo $_POST["book8"]."<br>";
//ตรวจคำตอบ
if($_POST["book8"]=="ประวัติศาสตร์")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "9.ในการสร้างสภาพแวดล้อมการเรียนรู้ดิจิทัลที่เต็มไปด้วยความหลากหลาย อาจารย์ควรทำอย่างไรเพื่อสนับสนุนการเรียนรู้ของนักเรียนที่มีระดับความเข้าใจและทักษะต่างกัน?<br>";
echo $_POST["book9"]."<br>";
//ตรวจคำตอบ
if($_POST["book9"]=="ใช้เทคโนโลยีในการปรับปรุงการสอนตามความต้องการของนักเรียน")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "10.การสร้างสถานการณ์การเรียนรู้ดิจิทัลที่ใช้เทคโนโลยีเพื่อสร้างประสบการณ์การเรียนที่มีความจริงมีประโยชน์อย่างไร?<br>";
echo $_POST["book10"]."<br>";
//ตรวจคำตอบ
if($_POST["book10"]=="ทำให้การเรียนรู้เป็นเรื่องน่าสนใจและมีความท้าทาย")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "11.การใช้เทคโนโลยีดิจิทัลในการสร้างบทเรียนที่สอดคล้องกับการเรียนรู้แบบเรียนรู้ตลอดชีวิต (Lifelong Learning) มีประโยชน์อย่างไร?<br>";
echo $_POST["book11"]."<br>";
//ตรวจคำตอบ
if($_POST["book11"]=="ช่วยในการพัฒนาทักษะและความรู้ตลอดชีวิต")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "12.เทคโนโลยีใดมีการใช้งานกับแอพพลิเคชันการเรียนรู้สำหรับภาษาต่างประเทศ?<br>";
echo $_POST["book12"]."<br>";
//ตรวจคำตอบ
if($_POST["book12"]=="Language Translation")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "13.ในการสร้างสภาพแวดล้อมการเรียนรู้ดิจิทัลที่เต็มไปด้วยความหลากหลาย อาจารย์ควรทำอย่างไรเพื่อสนับสนุนการเรียนรู้ของนักเรียนที่มีระดับความเข้าใจและทักษะต่างกัน?<br>";
echo $_POST["book13"]."<br>";
//ตรวจคำตอบ
if($_POST["book13"]=="ใช้เทคโนโลยีในการปรับปรุงการสอนตามความต้องการของนักเรียน")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "14.การใช้เทคโนโลยีในการสร้างวิดีโอสอนออนไลน์มีประโยชน์อย่างไร?<br>";
echo $_POST["book14"]."<br>";
//ตรวจคำตอบ
if($_POST["book14"]=="ช่วยให้นักเรียนเข้าใจเนื้อหาได้ง่ายขึ้น")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "15.การใช้เทคโนโลยีในการสร้างแบบทดสอบออนไลน์มีประโยชน์ในด้านใด?<br>";
echo $_POST["book15"]."<br>";
//ตรวจคำตอบ
if($_POST["book15"]=="ลดความซับซ้อนในการตรวจสอบและประเมินผล")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "16.การใช้เทคโนโลยีในการสร้างสถานการณ์การเรียนรู้ที่มีความเรียนรู้แบบประสบการณ์มีผลเชิงบวกต่อการเรียนรู้อย่างไร?<br>";
echo $_POST["book16"]."<br>";
//ตรวจคำตอบ
if($_POST["book16"]=="เพิ่มความน่าสนใจในการเรียน")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "17.การใช้เทคโนโลยีในการสร้างสถานการณ์การเรียนรู้ที่สมจริง (Virtual Reality) สามารถช่วยในการเรียนรู้เรื่องใดได้ดีที่สุด?<br>";
echo $_POST["book17"]."<br>";
//ตรวจคำตอบ
if($_POST["book17"]=="ประวัติศาสตร์")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "18.การใช้เทคโนโลยีในการสร้างสถานการณ์การเรียนรู้ที่มีความเรียนรู้แบบประสบการณ์มีประโยชน์อย่างไรต่อการพัฒนาทักษะสมัยใหม่ของนักเรียน?<br>";
echo $_POST["book18"]."<br>";
//ตรวจคำตอบ
if($_POST["book18"]=="ส่งเสริมการทดลองและการคิดเชิงสร้างสรรค์")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "19.การใช้เทคโนโลยีในการสร้างสถานการณ์การเรียนรู้ที่เต็มไปด้วยความหลากหลายมีประโยชน์อย่างไรต่อการสร้างสมองและความคิดสร้างสรรค์ของนักเรียน?<br>";
echo $_POST["book19"]."<br>";
//ตรวจคำตอบ
if($_POST["book19"]=="สร้างสถานการณ์ที่ต้องการการคิดเชิงสร้างสรรค์")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "20.เทคโนโลยีใดเหมาะสมที่สุดสำหรับการสร้างแบบทดสอบออนไลน์ที่สามารถปรับแต่งได้ตามความต้องการของผู้สอน?<br>";
echo $_POST["book20"]."<br>";
//ตรวจคำตอบ
if($_POST["book20"]=="Adaptive Learning Platforms")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "21.ในการใช้เทคโนโลยีในการสร้างสถานการณ์การเรียนรู้ที่เต็มไปด้วยความหลากหลาย เราสามารถใช้งานเทคโนโลยีใดเพื่อให้ผู้เรียนสามารถเข้าถึงเนื้อหาการเรียนอย่างอิสระและตามความสะดวก?<br>";
echo $_POST["book21"]."<br>";
//ตรวจคำตอบ
if($_POST["book21"]=="Mobile Learning")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "22.การใช้เทคโนโลยีในการสร้างสถานการณ์การเรียนรู้ที่มีการปรับปรุงและอัปเดตอยู่เสมอช่วยให้นักเรียนสามารถทำอะไรได้บ้าง?<br>";
echo $_POST["book22"]."<br>";
//ตรวจคำตอบ
if($_POST["book22"]=="ให้ประสบการณ์การเรียนรู้ที่ตรงจุด")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "23.การใช้เทคโนโลยีในการสร้างบทเรียนแบบโต้ตอบ (Interactive Lessons) ส่งผลต่อการเรียนรู้ของนักเรียนอย่างไร?<br>";
echo $_POST["book23"]."<br>";
//ตรวจคำตอบ
if($_POST["book23"]=="เพิ่มความสนใจในการเรียน")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "24.การใช้เทคโนโลยีในการสร้างแบบทดสอบออนไลน์มีประโยชน์ในด้านใด?<br>";
echo $_POST["book24"]."<br>";
//ตรวจคำตอบ
if($_POST["book24"]=="ลดความซับซ้อนในการตรวจสอบและประเมินผล")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "25.การใช้เทคโนโลยีในการสร้างบทเรียนแบบโต้ตอบ (Interactive Lessons) มีประโยชน์อย่างไรต่อการเรียนรู้ของนักเรียน?<br>";
echo $_POST["book25"]."<br>";
//ตรวจคำตอบ
if($_POST["book25"]=="เพิ่มความสนใจในการเรียน")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "26.เทคโนโลยีใดมีความสำคัญในการสนับสนุนการเรียนรู้แบบใช้เวลาจริง (Real-Time Learning) และการสื่อสารระหว่างนักเรียนและอาจารย์?<br>";
echo $_POST["book26"]."<br>";
//ตรวจคำตอบ
if($_POST["book26"]=="Video Conferencing")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "27.การใช้เทคโนโลยีในการสร้างบทเรียนที่ให้การตอบรับและตอบสนองต่อความต้องการของนักเรียนมีผลดีอย่างไร?<br>";
echo $_POST["book27"]."<br>";
//ตรวจคำตอบ
if($_POST["book27"]=="เพิ่มความสนใจและการมีส่วนร่วมของนักเรียน")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "28.เทคโนโลยีใดมีการใช้งานในการพัฒนาและปรับปรุงการศึกษาแบบมีการติดตามและประเมินผลอย่างสม่ำเสมอ?<br>";
echo $_POST["book28"]."<br>";
//ตรวจคำตอบ
if($_POST["book28"]=="Learning Management Systems (LMS)")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "29.การใช้เทคโนโลยีในการสร้างสถานการณ์การเรียนรู้ที่มีความเรียนรู้แบบประสบการณ์สามารถช่วยในการพัฒนาทักษะใดของนักเรียนได้?<br>";
echo $_POST["book29"]."<br>";
//ตรวจคำตอบ
if($_POST["book29"]=="การทดลองและการสังเกต")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "30.การใช้เทคโนโลยีในการสร้างบทเรียนแบบมีการตอบรับและปรับปรุงตามความก้าวหน้าของนักเรียนสามารถช่วยในการสร้างอะไรได้?<br>";
echo $_POST["book30"]."<br>";
//ตรวจคำตอบ
if($_POST["book30"]=="การสนับสนุนการเรียนรู้ตลอดชีพ")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "31.เทคโนโลยีใดมีบทบาทสำคัญในการสนับสนุนการเรียนรู้แบบทำงานร่วมกัน (Collaborative Learning) ซึ่งนักเรียนสามารถทำงานร่วมกันผ่านอินเทอร์เน็ตได้?<br>";
echo $_POST["book31"]."<br>";
//ตรวจคำตอบ
if($_POST["book31"]=="Social Media Platforms")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "32.การใช้เทคโนโลยีในการสร้างสถานการณ์การเรียนรู้ที่เป็นการผจญภัย (Adventure Learning) ช่วยในการพัฒนาทักษะใดของนักเรียน?<br>";
echo $_POST["book32"]."<br>";
//ตรวจคำตอบ
if($_POST["book32"]=="การสร้างและการคิดเชิงสร้างสรรค์")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "33.เทคโนโลยีใดมีความสำคัญในการสนับสนุนการเรียนรู้แบบปฏิสัมพันธ์ (Interactive Learning) โดยการเป็นตัวกลางในการสร้างประสบการณ์การเรียนรู้ที่มีการมีส่วนร่วมของผู้เรียน?<br>";
echo $_POST["book33"]."<br>";
//ตรวจคำตอบ
if($_POST["book33"]=="Augmented Reality")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "34.เทคโนโลยีใดมีความสำคัญในการสนับสนุนการเรียนรู้แบบใช้เวลาจริง (Real-Time Learning) ซึ่งนักเรียนสามารถทำการแลกเปลี่ยนความคิดเห็นและประสบการณ์กับผู้เรียนอื่นๆ ได้?<br>";
echo $_POST["book34"]."<br>";
//ตรวจคำตอบ
if($_POST["book34"]=="Video Conferencing")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "35.การใช้เทคโนโลยีในการสร้างบทเรียนที่มีการตอบรับและปรับปรุงตามความต้องการของนักเรียนมีประโยชน์อย่างไรต่อการพัฒนาทักษะสมัยใหม่ของนักเรียน?<br>";
echo $_POST["book35"]."<br>";
//ตรวจคำตอบ
if($_POST["book35"]=="ส่งเสริมการทดลองและการคิดเชิงสร้างสรรค์")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "36.การใช้เทคโนโลยีในการสร้างแบบทดสอบออนไลน์ที่มีการปรับแต่งตามระดับความเข้าใจและความสามารถของนักเรียนมีประโยชน์อย่างไร?<br>";
echo $_POST["book36"]."<br>";
//ตรวจคำตอบ
if($_POST["book36"]=="ช่วยให้การเรียนรู้มีการปรับปรุงตามความคาดหวังของนักเรียน")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "37.การใช้เทคโนโลยีในการสร้างแบบทดสอบออนไลน์ที่มีการใช้ข้อมูลที่มีคุณภาพมากขึ้นในกระบวนการการสอบมีผลเชิงบวกต่อด้านใดของการเรียนรู้?<br>";
echo $_POST["book37"]."<br>";
//ตรวจคำตอบ
if($_POST["book37"]=="การพัฒนาทักษะการเรียนรู้")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "38.การใช้เทคโนโลยีในการสร้างบทเรียนที่มีการเรียนรู้แบบประสบการณ์สามารถช่วยในการสร้างอะไรได้?<br>";
echo $_POST["book38"]."<br>";
//ตรวจคำตอบ
if($_POST["book38"]=="การทดลองและการสังเกต")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "39.เทคโนโลยีใดมีบทบาทสำคัญในการพัฒนาและปรับปรุงการศึกษาแบบมีการติดตามและประเมินผลอย่างสม่ำเสมอ?<br>";
echo $_POST["book39"]."<br>";
//ตรวจคำตอบ
if($_POST["book39"]=="Learning Management Systems (LMS)")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "40.การใช้เทคโนโลยีในการสร้างสถานการณ์การเรียนรู้ที่มีการมีส่วนร่วมของผู้เรียนสามารถช่วยในการพัฒนาทักษะใดของนักเรียนได้?<br>";
echo $_POST["book40"]."<br>";
//ตรวจคำตอบ
if($_POST["book40"]=="การทดลองและการสังเกต")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "41.เทคโนโลยีใดมีความสำคัญในการสนับสนุนการเรียนรู้แบบทำงานร่วมกัน (Collaborative Learning) ซึ่งนักเรียนสามารถทำงานร่วมกันผ่านอินเทอร์เน็ตได้?<br>";
echo $_POST["book41"]."<br>";
//ตรวจคำตอบ
if($_POST["book41"]=="Social Media Platforms")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "42.การใช้เทคโนโลยีในการสร้างบทเรียนที่มีการตอบรับและปรับปรุงตามความต้องการของนักเรียนมีประโยชน์อย่างไรต่อการพัฒนาทักษะสมัยใหม่ของนักเรียน?<br>";
echo $_POST["book42"]."<br>";
//ตรวจคำตอบ
if($_POST["book42"]=="ส่งเสริมการทดลองและการคิดเชิงสร้างสรรค์")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "43.การใช้เทคโนโลยีในการสร้างแบบทดสอบออนไลน์ที่มีการใช้ข้อมูลที่มีคุณภาพมากขึ้นในกระบวนการการสอบมีผลเชิงบวกต่อด้านใดของการเรียนรู้?<br>";
echo $_POST["book43"]."<br>";
//ตรวจคำตอบ
if($_POST["book43"]=="การพัฒนาทักษะการเรียนรู้")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "44.การใช้เทคโนโลยีในการสร้างบทเรียนที่มีการเรียนรู้แบบประสบการณ์สามารถช่วยในการสร้างอะไรได้?<br>";
echo $_POST["book44"]."<br>";
//ตรวจคำตอบ
if($_POST["book44"]=="การทดลองและการสังเกต")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "45.เทคโนโลยีใดมีบทบาทสำคัญในการพัฒนาและปรับปรุงการศึกษาแบบมีการติดตามและประเมินผลอย่างสม่ำเสมอ?<br>";
echo $_POST["book45"]."<br>";
//ตรวจคำตอบ
if($_POST["book45"]=="Learning Management Systems (LMS)")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "46.การใช้เทคโนโลยีในการสร้างสถานการณ์การเรียนรู้ที่มีการมีส่วนร่วมของผู้เรียนสามารถช่วยในการพัฒนาทักษะใดของนักเรียนได้?<br>";
echo $_POST["book46"]."<br>";
//ตรวจคำตอบ
if($_POST["book46"]=="การทดลองและการสังเกต")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "47.การใช้เทคโนโลยีในการสร้างบทเรียนที่มีการเรียนรู้แบบประสบการณ์สามารถช่วยในการสร้างอะไรได้?<br>";
echo $_POST["book47"]."<br>";
//ตรวจคำตอบ
if($_POST["book47"]=="การทดลองและการสังเกต")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "48.เทคโนโลยีใดมีบทบาทสำคัญในการพัฒนาและปรับปรุงการศึกษาแบบมีการติดตามและประเมินผลอย่างสม่ำเสมอ?<br>";
echo $_POST["book48"]."<br>";
//ตรวจคำตอบ
if($_POST["book48"]=="Learning Management Systems (LMS)")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "49.การใช้เทคโนโลยีในการสร้างบทเรียนที่มีการเรียนรู้แบบประสบการณ์สามารถช่วยในการสร้างอะไรได้?<br>";
echo $_POST["book49"]."<br>";
//ตรวจคำตอบ
if($_POST["book49"]=="การทดลองและการสังเกต")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}

echo "50.การใช้เทคโนโลยีในการสร้างแบบทดสอบออนไลน์ที่มีการใช้ข้อมูลที่มีคุณภาพมากขึ้นในกระบวนการการสอบมีผลเชิงบวกต่อด้านใดของการเรียนรู้?<br>";
echo $_POST["book50"]."<br>";
//ตรวจคำตอบ
if($_POST["book50"]=="การพัฒนาทักษะการเรียนรู้")
{echo"ถูกต้อง"."<br>";$score++;}
else
{echo"ยังไม่ถูกต้อง"."<br>";}





//แสดงคะแนน
echo "คะแนนที่ได้"."$score";
?>

</body>
</html>